insert into card (name)
values ('Зарплатная'),
       ('Дебетовая'),
       ('Кредитная');

insert into sale_point (name)
values ('Автозаправка'), -- 1 <1, 3>
       ('Кинотеатр'), -- 2 <2>
       ('Авиакасса'), -- 3 <1, 2>
       ('Аптека'), -- 4 <3>
       ('Супермаркет'); -- 5 <1, 2, 3>

insert into cashback (value, card_id, sale_point_id)
values (5, 1, 1), -- данные для зарплатной карты
       (3, 1, 3),
       (1, 1, 5),
       (5, 2, 2), -- данные для дебетовой карты
       (4, 2, 4),
       (3, 2, 3),
       (1, 2, 5),
       (7, 3, 4), -- данные для кредитной карты
       (5, 3, 1),
       (1, 3, 5);